#+TITLE: SWITCH AND BREAK STATEMENTS
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:CSC100 Introduction to programming in C/C++ (Spring 2025)
#+STARTUP: overview hideblocks indent inlineimages
#+OPTIONS: toc:nil ^:nil num:nil
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :exports both :results output :noweb yes :tangle yes
* Another simple example

- In the example program below, the ~grade~ is set in the variable
  declaration. Depending on the value, a =case= is triggered and the
  corresponding statements are executed.

- *Pseudocode:* What is the output of the code below for ~grade =~
  5,3,0,-1,0.5?
  #+begin_example
  SET grade = 5

  SWITCH grade
      CASE 1 to 4
         OUTPUT "Passing"
         BREAK
      CASE 5 or 6
         OUTPUT "FAILING"
         BREAK
      DEFAULT
         OUTPUT "Illegal grade"
         BREAK
  END SWITCH
  #+end_example

- What does this program do? Which problem/solution is implemented?
  #+begin_quote
  Answer: The program reflects "passing" grades 4,3,2,1, and "failing"
  grade 5,6. Any other grade value is not allowed. (This happens to be
  the German grade scale, which is A = 1 to D = 4, and F = 5 or 6.)
  #+end_quote

- *Source code:* Code along in OneCompiler - [[https://onecompiler.com/c/43c3jez7k][onecompiler.com/c/43c3jez7k]]
  #+name: switch
  #+begin_src C :results output :exports both
    int grade = 5;
    switch (grade) {
     case 4:
     case 3:
     case 2:
     case 1:
       printf("Passing");
       break;
     case 5:
     case 6:
       printf("Failing");
       break;
     default:
       printf("Illegal grade");
       break;
     }
  #+end_src

  #+RESULTS: switch
  : Failing

- All output cases:
  #+begin_quote
  | VALUE | OUTPUT        |
  |-------+---------------|
  |     5 | Failing       |
  |     3 | Passing       |
  |     0 | Illegal grade |
  |    -1 | Illegal grade |
  |   0.5 | Illegal grade |
  |   1.5 | Passing       | Anomaly: 1.5 is truncated to 1
  #+end_quote

- You can also put several case labels on the same line as shown
  below - the code is otherwise identical to the previous one:

  #+name: switch1
  #+begin_src C :results output :exports both
    int grade = 3;

    switch (grade) {
     case 4: case 3: case 2: case 1:
       printf("Passing");
       break;
     case 5: case 6:
       printf("Failing");
       break;
     default:
       printf("Illegal grade");
       break;
     }
  #+end_src

- The ~default~ case (when none of the case expressions apply) is
  *optional*, and it does not have to come last!

- Note: *You cannot write a case label for a range of values*. 

- To make this happen in C, you'd have to use a loop to cycle through
  a range, using a loop over the values of an array:
  #+begin_src C :results output :exports both
    int grade;
    int i; // loop variable
    float grades[]={5,3,0,-1,0.5}; // array of grades
    size_t length_of_grades = sizeof(grades)/sizeof(grades[0]);

    for (i = 0; i < length_of_grades; i++) { // LOOP through grades
      grade = (int)grades[i];
      switch (grade) {  // SWITCH grade
      case 4:
      case 3:
      case 2:
      case 1:
        printf("%d: Passing\n", grade);
        break;
      case 5:
      case 6:
        printf("%d: Failing\n", grade);
        break;
      default:
        printf("%d: Illegal grade\n", grade);
      }  // END SWITCH
     } // END LOOP
  #+end_src

  #+RESULTS:
  : 5: Failing
  : 3: Passing
  : 0: Illegal grade
  : -1: Illegal grade
  : 0: Illegal grade

** Sample solution

#+begin_src C :exports code
  #include <stdio.h>

  int main() {
    // Declare an integer variable 'day' and set it to a test value (1-7)
    // e.g., int day = 3;
    int day = 3; // Declare an integer variable 'day' and set it to a test value (1-7)

    // Write a switch statement to evaluate 'day'
    switch (day) { // Write a switch statement to evaluate 'day'
      // Case for day 1: Print "Monday: Start of the workweek!"
      // Add break statement
    case 1: // Case for day 1
      printf("Monday: Start of the workweek!\n"); // Print "Monday: Start of the workweek!"
      break; // Add break statement

      // Case for day 2: Print "Tuesday: Getting into the groove."
      // Add break statement
    case 2: // Case for day 2
      printf("Tuesday: Getting into the groove.\n"); // Print "Tuesday: Getting into the groove."
      break; // Add break statement

      // Case for day 3: Print "Wednesday: Midweek already!"
      // Add break statement
    case 3: // Case for day 3
      printf("Wednesday: Midweek already!\n"); // Print "Wednesday: Midweek already!"
      break; // Add break statement

      // Case for day 4: Print "Thursday: Almost there!"
      // Add break statement
    case 4: // Case for day 4
      printf("Thursday: Almost there!\n"); // Print "Thursday: Almost there!"
      break; // Add break statement

      // Case for day 5: Print "Friday: Weekend is near!"
      // Add break statement
    case 5: // Case for day 5
      printf("Friday: Weekend is near!\n"); // Print "Friday: Weekend is near!"
      break; // Add break statement

      // Case for day 6: Print "Saturday: Time to relax!"
      // Add break statement
    case 6: // Case for day 6
      printf("Saturday: Time to relax!\n"); // Print "Saturday: Time to relax!"
      break; // Add break statement

      // Case for day 7: Print "Sunday: Rest and recharge."
      // Add break statement
    case 7: // Case for day 7
      printf("Sunday: Rest and recharge.\n"); // Print "Sunday: Rest and recharge."
      break; // Add break statement

      // Default case: Print "Error: Not a valid day!"
      // Add break statement
    default: // Default case
      printf("Error: Not a valid day!\n"); // Print "Error: Not a valid day!"
      break; // Add break statement
    }
    return 0;
  }
#+end_src

#+RESULTS:
: Wednesday: Midweek already!

